[
  {
    "id": "project-1",
    "title": "Web Phishing Prediction Using Machine Learning",
    "description": "A phishing detection model using Gradient Boosting Classifier with 97.4% accuracy.",
    "longDescription": "Developed a machine learning model to detect phishing websites using Gradient Boosting Classifier, achieving 97.4% accuracy. The project focused on minimizing false positives and improving performance with larger datasets. Implemented data preprocessing, feature engineering, and model evaluation techniques. Proposed future enhancements include real-time detection capabilities and hybrid detection systems combining multiple ML algorithms.",
    "tags": ["Python", "Machine Learning", "Gradient Boosting", "Data Analysis", "Google Colab", "VS Code"],
    "imageUrl": "https://images.pexels.com/photos/60504/security-protection-anti-virus-software-60504.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "githubUrl": "https://github.com/Sunderpechai",
    "featured": true
  },
  {
    "id": "project-2",
    "title": "Real-Time Human Pose Detector",
    "description": "Real-time pose detection system using NVIDIA Jetson Nano and OpenPose deep learning model.",
    "longDescription": "Built a real-time human pose detection system using NVIDIA Jetson Nano and deep learning models (OpenPose). The system enables accurate pose estimation and visualization for applications in healthcare monitoring, sports analysis, and fitness tracking. Implemented using TensorFlow and OpenCV for efficient real-time processing. The project demonstrates proficiency in computer vision, deep learning deployment on edge devices, and real-time video processing.",
    "tags": ["Python", "TensorFlow", "OpenCV", "Deep Learning", "Computer Vision", "NVIDIA Jetson Nano", "OpenPose"],
    "imageUrl": "https://images.pexels.com/photos/8438918/pexels-photo-8438918.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "githubUrl": "https://github.com/Sunderpechai",
    "featured": true
  }
]